Repository: frencsi/papyrus-client
Catalog: src/PapyrusClient/Resources/Ui/Pages/Home.*.resx
Languages: hu_hu

# MessageBarLoadingFilesTitle
source: Loading Files
hu_hu: Fájlok Betöltése

# MessageBarProcessingFilesTitle
source: Processing Files
hu_hu: Fájlok Feldolgozása

# MessageBarLoadingFilesBody
source: The browser window may freeze temporarily during this process.
hu_hu: A böngészőablak ideiglenesen lefagyhat a folyamat során.

# MessageBarProcessingFilesBody
source: The browser window may freeze temporarily during this process.
hu_hu: A böngészőablak ideiglenesen lefagyhat a folyamat során.

# DataGridFileTitle
source: File
hu_hu: Fájl

# InputFilePart1
source: Drag Excel files here to load, or
hu_hu: Húzd ide az Excel-fájlokat a feltöltéshez, vagy

# InputFilePart2
source: browse
hu_hu: válaszd ki

# InputFilePart3
source: for them.
hu_hu: őket.

# InputFileMaximumFilesAllowedPerLoad
source: Up to {0} files are allowed per load.
hu_hu: Legfeljebb {0} fájl tölthető be egyszerre.

# InputFileSupportedFileFormats
source: Supported file formats: {0}.
hu_hu: Támogatott fájlformátumok: {0}.

# InputFileMaximumFilesExceeded
source: You can only load {0} files at once.
hu_hu: Egyszerre csak {0} fájlt tölthetsz be.

# NoFilesSelected
source: Please select at least one file.
hu_hu: Kérlek, válassz ki legalább egy fájlt.

# InvalidFilesSelected
source: Only files with valid data can be processed.
hu_hu: Csak az érvényes adatokkal rendelkező fájlok dolgozhatók fel.

# FilesProcessingError
source: An error occured during processing. Please see the console for more details.
hu_hu: Hiba történt a fájlok feldolgozás során. További részletekért kérlek, nyisd meg a konzolt.

source: Process
hu_hu: Feldolgozás

source: Remove
hu_hu: Törlés

# MessageBarUnhandledStateTitle
source: Unhandled State
hu_hu: Nem Kezelt Státusz

# MessageBarUnhandledStateBody
source: Unhandled state: '{0}' in '{1}' page.
hu_hu: Nem kezelt állapot: '{0}' a(z) '{1}' oldalon.
