Repository: frencsi/papyrus-client
Catalog: src/PapyrusClient/Resources/Services/WorkScheduleReader/ExcelWorkScheduleReader.*.resx
Languages: hu_hu

# MISSING_FILE_EXTENSION
source: File extension is required.
hu_hu: A fájlkiterjesztés megadása kötelező.

# UNSUPPORTED_FILE_EXTENSION
source: The file extension '{0}' is not supported.
hu_hu: A(z) '{0}' fájlkiterjesztés nem támogatott.

# FILE_TOO_LARGE
source: The file size ({0}) exceeds the maximum allowed size ({1}).
hu_hu: A fájl mérete ({0}) meghaladja a megengedett maximális méretet ({1}).

# MISSING_COMPANY_NAME
source: Company name is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: A cég neve hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# MISSING_LOCATION_ADDRESS
source: Location address is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: A hely címe hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# MISSING_YEARMONTH
source: Year & month is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: Az év & hónap hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# INVALID_YEAR_IN_YEARMONTH
source: The year in year and month is invalid. Value: {0}. Please check the cell (column, row): {1}, {2}.
hu_hu: Az év az év és hónap mezőben érvénytelen. Érték: {0}. Kérlek, ellenőrizd a cellát (oszlop, sor): {1}, {2}.

# INVALID_MONTH_IN_YEARMONTH
source: The month in year and month is invalid. Value: {0}. Please check the cell (column, row): {1}, {2}.
hu_hu: A hónap az év és hónap mezőben érvénytelen. Érték: {0}. Kérlek, ellenőrizd a cellát (oszlop, sor): {1}, {2}.

# MISSING_SCHEDULE_TYPE
source: Work schedule type is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: Munkaidő-beosztás típusa hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# INVALID_SCHEDULE_TYPE
source: Invalid work schedule type. Value: {0}. Please check the cell (column, row): {1}, {2}.
hu_hu: Munkaidő-beosztás típusa érvénytelen. Érték: {0}. Kérlek, ellenőrizd a cellát (oszlop, sor): {1}, {2}.

# MISSING_SHIFT_DATE
source: Shift date is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: A műszak dátuma hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# INVALID_SHIFT_DATE
source: Invalid shift date. Value: {0}. Please check the cell (column, row): {1}, {2}.
hu_hu: Érvénytelen műszak dátum. Érték: {0}. Kérlek, ellenőrizd a cellát (oszlop, sor): {1}, {2}.

# MISSING_SHIFT_EMPLOYEE
source: Employee on shift is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: A műszakban lévő dolgozó hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# MISSING_SHIFT_TIME
source: Shift time is missing. Please check the cell (column, row): {0}, {1}.
hu_hu: A műszak ideje hiányzik. Kérlek, ellenőrizd a cellát (oszlop, sor): {0}, {1}.

# INVALID_SHIFT_TIME
source: Invalid shift time. Value: {0}. Please check the cell (column, row): {1}, {2}.
hu_hu: Érvénytelen a műszak ideje. Érték: {0}. Kérlek, ellenőrizd a cellát (oszlop, sor): {1}, {2}.
