Repository: frencsi/papyrus-client
Catalog: src/PapyrusClient/Resources/Services/WorkScheduleReader/WorkScheduleExcelReader.*.resx
Languages: hu_hu

# MissingFileExtension
source: Missing file extension. Please ensure the file includes a valid extension (e.g., {0}) before proceeding.
hu_hu: Hiányzó fájlkiterjesztés. A fájlnévnek érvényes kiterjesztést kell tartalmaznia (például: {0}) a folytatáshoz

# InvalidFileExtension
source: Invalid file extension. The file's extension "{0}" is not supported. Please use a valid extension (e.g., {1}).
hu_hu: Érvénytelen fájlkiterjesztés. A fájl kiterjesztése "{0}" nem támogatott. Kérlek, használj érvényes kiterjesztést (például: {1}).

# FileIsTooLarge
source: File is too large. The file size is {0} bytes and exceeds the maximum limit of {1} bytes.
hu_hu: A fájl túl nagy. A fájl mérete {0} bájt, amely meghaladja a {1} bájtos maximális korlátot.

# MissingCompanyName
source: Missing company name. Please fill it in the cell (Column: {0}, Row: {1}).
hu_hu: Hiányzik a cég neve. Kérlek, töltsd ki a hozzá tartozó cellát (Oszlop: {0}, Sor: {1}).

# MissingAddress
source: Missing address. Please fill it in the cell (Column: {0}, Row: {1}).
hu_hu: Hiányzik a cím. Kérlek, töltsd ki a hozzá tartozó cellát (Oszlop: {0}, Sor: {1}).

# MissingYearAndMonth
source: Missing year and month. Please fill it in the cell (Column: {0}, Row: {1}).
hu_hu: Hiányzik az év és a hónap. Kérlek, töltsd ki a hozzá tartozó cellát (Oszlop: {0}, Sor: {1}).

# InvalidYearInYearAndMonth
source: Invalid year in the provided year and month. Please check the cell (Column: {0}, Row: {1}). Value: {2}.
hu_hu: Érvénytelen év szerepel az adott év és hónapban. Kérlek, ellenőrizd a cellát (Oszlop: {0}, Sor: {1}). Érték: {2}.

# InvalidMonthInYearAndMonth
source: Invalid month in the provided year and month. Please check the cell (Column: {0}, Row: {1}). Value: {2}.
hu_hu: Érvénytelen hónap szerepel az adott év és hónapban. Kérlek, ellenőrizd a cellát (Oszlop: {0}, Sor: {1}). Érték: {2}.

# MissingWorkType
source: Missing work type. Please fill it in the cell (Column: {0}, Row: {1}).
hu_hu: Hiányzik a munkatípus. Kérlek, töltsd ki a hozzá tartozó cellát (Oszlop: {0}, Sor: {1}).

# InvalidWorkType
source: Invalid work type provided. The work type '{3}' is not supported. Please use a valid work type (e.g., '{4}') and update the cell (Column: {0}, Row: {1}).
hu_hu: Érvénytelen munkatípus. A(z) '{3}' munkatípus nem támogatott. Kérlek, használj egy érvényes munkatípust (pl. '{4}') és frissítsd a cellát (Oszlop: {0}, Sor: {1}).

# MissingDate
source: Missing date. Please fill it in the cell (Column: {0}, Row: {1}).
hu_hu: Hiányzik a dátum. Kérlek, töltsd ki a hozzá tartozó cellát (Oszlop: {0}, Sor: {1}).

# InvalidDate
source: Invalid date provided. Please check the cell (Column: {0}, Row: {1}). Value: {2}.
hu_hu: Érvénytelen dátum lett megadva. Kérlek, ellenőrizd a cellát (Oszlop: {0}, Sor: {1}). Érték: {2}.

# MissingEmployeeName
source: Missing employee name. Please fill it in the cell (Column: {0}, Row: {1}).
hu_hu: Hiányzik az alkalmazott neve. Kérlek, töltsd ki a cellát (Oszlop: {0}, Sor: {1}).

# InvalidTime
source: Invalid time provided. Please use the correct 24-hour format or the continuation marker '{3}'. Check the cell (Column: {0}, Row: {1}). Value: {2}.
hu_hu: Érvénytelen idő. Kérlek, használd a helyes 24 órás formátumot, vagy a folytatásjelzőt: '{3}'. Ellenőrizd a cellát (oszlop: {0}, sor: {1}). Érték: {2}.
