Repository: frencsi/papyrus-client
Catalog: src/PapyrusClient/Resources/Ui/Dialogs/WorkScheduleViewerDialog.*.resx
Languages: hu_hu

# DIALOG_TITLE
source: Information about the work schedule
hu_hu: Információ a munkaidő-beosztásról

# TAB_STATUS
source: Status
hu_hu: Státusz

# TAB_RULES
source: Rules
hu_hu: Szabályok

# TAB_DETAILS
source: Details
hu_hu: Részletek

# STATUS_OK
source: Work schedule has been read and validated successfully.
hu_hu: A munkaidő-beosztás sikeresen be lett olvasva és ellenőrizve.

# STATUS_READ_ERROR
source: Read error occurred while processing the work schedule.
hu_hu: Olvasási hiba történt a munkaidő-beosztás feldolgozása közben.

# STATUS_VALIDATE_ERROR
source: Validation error occurred while processing the work schedule.
hu_hu: Ellenőrzési hiba történt a munkaidő-beosztás feldolgozása közben.

# STATUS_GENERAL_ERROR
source: An error occurred while processing the work schedule.
hu_hu: Hiba történt a munkaidő-beosztás feldolgozása közben.

# MESSAGEBAR_TITLE_NOT_IMPLEMENTED
source: Tab not implemented
hu_hu: Fül még nincs kész

# MESSAGEBAR_BODY_NOT_IMPLEMENTED
source: This tab will be available in a future update.
hu_hu: Ez a fül egy későbbi frissítésben lesz elérhető.

# DETAILS_ID
source: ID
hu_hu: Azonosító

# DETAILS_NAME
source: Name
hu_hu: Név

# DETAILS_SOURCE
source: Source
hu_hu: Forrás

# DETAILS_SOURCE_UNKNOWN
source: Unknown
hu_hu: Ismeretlen

# DETAILS_SOURCE_FILE
source: File
hu_hu: Fájl

# MESSAGEBAR_BODY_NOT_FOUND
source: The specified tab '{0}', could not be found. Please check if the tab name is correct or choose a valid tab.
hu_hu: A megadott '{0}' fül nem található. Ellenőrizd, hogy a fül neve helyes-e, vagy válassz egy érvényes fület.

# MESSAGEBAR_TITLE_NOT_FOUND
source: Tab not found
hu_hu: Fül nem található
