Repository: frencsi/papyrus-client
Catalog: src/PapyrusClient/Resources/Services/WorkScheduleValidator/WorkScheduleValidator.*.resx
Languages: hu_hu

# RULE_NOT_SET
source: No rule is set for the work schedule, so validation can't proceed. Please provide a rule.
hu_hu: Nincs szabály beállítva a munkaidő-beosztáshoz, ezért az érvényesítés nem folytatható. Kérlek, rendelj hozzá szabályt.

# CANT_VALIDATE_BECAUSE_READ_ERROR
source: The work schedule cannot be validated because there was a reading error beforehand. Please resolve the reading error first.
hu_hu: Nem lehet érvényesíteni a munkaidő-beosztást, mert korábban olvasási hiba történt. Kérlek, először oldd meg az olvasási hibát.

# SHIFTS_DATE_YEAR_NOT_MATCH_SCHEDULE_YEAR
source: The year of the shift(s) date does not match the year of the work schedule. Year of the shift(s) date: '{0}'. Year of the work schedule: '{1}'. Please check the following shift(s) date: '{2}'.
hu_hu: A műszak(ok) dátumának éve nem egyezik a munkidő-beosztás évével. A műszak(ok) éve: '{0}'. A munkidő-beosztás éve: '{1}'. Kérlek, ellenőrizd a következő műszak(ok) dátumát: '{2}'.

# SHIFTS_DATE_MONTH_NOT_MATCH_SCHEDULE_MONTH
source: The month of the shift(s) date does not match the month of the work schedule. Month of the shift(s) date: '{0}'. Month of the work schedule: '{1}'. Please check the following shift(s) date: '{2}'.
hu_hu: A műszak(ok) dátumának hónapja nem egyezik a munkidő-beosztás hónapjával. A műszak(ok) hónapja: '{0}'. A munkidő-beosztás hónapja: '{1}'. Kérlek, ellenőrizd a következő műszak(ok) dátumát: '{2}'.

# SHIFT_DURATION_IS_NEGATIVE_OR_ZERO
source: Shift duration can't be negative or zero. Details: '{0}'.
hu_hu: A műszak hossza nem lehet negatív vagy nulla. Részletek: {0}.

# SHIFT_CONTINUITY_VALIDATION_NOT_SUPPORTED
source: Only the operator work schedule type currently supports shift continuity validation.
hu_hu: Jelenleg csak az operátor munkarend típus támogatja a műszakfolytonosság ellenőrzését.

# PREVIOUS_SHIFT_MISSING_END_CONTINUATION_MARKER
source: A required 'end' continuation marker is missing for the employee '{0}' on '{1}'. This marker is needed because the shift on '{2}' for the same employee starts with a continuation marker. Please review the following dates: '{2}' and '{1}'.
hu_hu: Hiányzik végzésnél a folytatás jelölő az alábbi alkalmazottnál: '{0}', dátum: '{1}'. Azért kell, mert '{2}' dátumon folytatás jelölővel kezdődik a műszak ugyanannál az alkalmazottnál. Kérlek, nézd át ezeket a dátumokat: '{2}' és '{1}'.

# PREVIOUS_SHIFT_MULTIPLE_END_CONTINUATION_MARKER_FOUND
source: Multiple end continuation markers were found for employee '{0}' on '{1}'. Please review the following dates: '{2}' and '{1}'.
hu_hu: Több folytatás jelölőt találtam végzésre ennél az alkalmazottnál: '{0}', dátum: '{1}'. Kérlek, nézd át ezeket a dátumokat: '{2}' és '{1}'.

# GAP_DETECTED_BETWEEN_SHIFTS
source: A gap was detected between shifts on '{0}'. Details: - Previous Shift: Employee '{1}' from '{2}' to '{3}' - Next Shift: Employee '{4}' from '{5}' to '{6}' - Gap: '{7}' Please ensure that no gaps exist between shifts.
hu_hu: Rést találtam a műszakok között a következő napon: '{0}'. - Előző műszak: '{1}' dolgozó, '{2}'-tól '{3}'-ig. - Következő műszak: '{4}' dolgozó, '{5}'-től '{6}'-ig. - A rés hossza: '{7}'. Kérlek, nézd át a műszakokat.

# OVERLAP_DETECTED_BETWEEN_SHIFTS
source: There is an overlap in shifts on '{0}'. Details: - Previous Shift: Employee '{1}' from '{2}' to '{3}' - Next Shift: Employee '{4}' from '{5}' to '{6}' Please review the timings for overlapping shifts.
hu_hu: Átfedés van a műszakok között '{0}'-n. Előző műszak: '{1}' dolgozó, '{2}'-tól '{3}'-ig. Következő műszak: '{4}' dolgozó, '{5}'-től '{6}'-ig. Kérlek, nézd át a műszakok időpontját.

# EMPLOYEE_SHIFT_DURATION_IS_GREATER_THAN_RULE
source: Employee '{0}' logged '{1}' time, which exceeds the maximum allowed limit of '{2}'. Please review the following date: '{3}'.
hu_hu: Az alkalmazott '{0}' {1} időt rögzített, ami meghaladja az engedélyezett maximumot: '{2}'. Nézd meg ezt a dátumot: '{3}'.

# COMBINED_SHIFTS_DURATION_IS_GREATER_THAN_RULE
source: The combined total shift time '{0}' exceeded the allowed maximum of '{1}'. Please review the shifts on the following date: '{2}'.
hu_hu: A teljes összeadott műszakidő '{0}' meghaladta a megengedett maximumot: '{1}'. Kérlek, nézd meg ezen a dátumon a műszakokat: '{2}'.

# MISSING_REQUIRED_DATES
source: Shift data is missing for the following days: [{0}].
hu_hu: Hiányoznak műszakok a következő napokon: [{0}].
